Revit 2026 API

# NoiseNoiseColor1 Property

---

The property labeled "Color 1" from the "Noise" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string NoiseColor1 { get; }
```
```vb
Public Shared ReadOnly Property NoiseColor1 As String
	Get
```
```cpp
public:
static property String^ NoiseColor1 {
	String^ get ();
}
```
```fsharp
static member NoiseColor1 : string with get
```

#### Property Value

String

This property is of type "AssetPropertyDoubleArray4d". This property allows a connected asset.

#### Reference

Noise Class

Autodesk.Revit.DB.Visual Namespace